app/views/ezags/get_act_record_birth.xml

<?xml version="1.0" encoding="UTF-8"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
  <S:Header>
    <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" S:actor="http://smev.gosuslugi.ru/actors/smev">
      <wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" wsu:Id="CertId">MIIDjzCCAz6gAwIBAgIKdv4jIQAAAAAEyDAIBgYqhQMCAgMwgYgxHjAcBgkqhkiG9w0BCQEWD29p
dEBtaW5zdnlhei5ydTELMAkGA1UEBhMCUlUxFTATBgNVBAcMDNCc0L7RgdC60LLQsDEsMCoGA1UE
Cgwj0JzQuNC90LrQvtC80YHQstGP0LfRjCDQoNC+0YHRgdC40LgxFDASBgNVBAMMC9Cj0KYg0K3Q
n18xMB4XDTEyMTEyMjE0MDEwMFoXDTEzMTEyMjE0MTAwMFowgZAxCzAJBgNVBAYTAlJVMSUwIwYD
VQQKHhwEHAQ4BD0EOgQ+BDwEQQQyBE8ENwRMACAEIAQkMS8wLQYDVQQLHiYEGAQhACAELQQ7BDUE
OgRCBEAEPgQ9BD0ESwQ5ACAEFwQQBBMEITEpMCcGA1UEAx4gBBwEOAQ9BDoEPgQ8BEEEMgRPBDcE
TAAgBCAEJAAgADIwYzAcBgYqhQMCAhMwEgYHKoUDAgIkAAYHKoUDAgIeAQNDAARACxNhPI3o9hHR
TzP7QWdp6ayDAFLBVZt0+5jvQtitQHKW1wcYe5tk1DRNr+8ADhndVQMwH8oTXXyAX6yIsjuqPaOC
AXwwggF4MA4GA1UdDwEB/wQEAwIE8DAZBgkqhkiG9w0BCQ8EDDAKMAgGBiqFAwICFTAkBgNVHSUE
HTAbBgYqhQNkAgIGByqFAwICIgYGCCsGAQUFBwMCMB0GA1UdDgQWBBRlxZnxgmJGNfgyiLQolax7
u0tpJDAfBgNVHSMEGDAWgBQ+5h+il5HGoBNa/X0Gk2cHXjzbxTBmBgNVHR8EXzBdMFugWaBXhiho
dHRwOi8vbW9zY293LnJ0LnJ1L2Rvd25sb2FkL2NhX2VwXzEuY3JshitodHRwOi8vc3RhdGljLmdv
c3VzbHVnaS5ydS9jZXJ0L2NhX2VwXzEuY3JsMH0GCCsGAQUFBwEBBHEwbzA0BggrBgEFBQcwAoYo
aHR0cDovL21vc2Nvdy5ydC5ydS9kb3dubG9hZC9jYV9lcF8xLmNydDA3BggrBgEFBQcwAoYraHR0
cDovL3N0YXRpYy5nb3N1c2x1Z2kucnUvY2VydC9jYV9lcF8xLmNydDAIBgYqhQMCAgMDQQAaYYtb
3IZ+hpMi0gzI4derkBRR1PEfybfCpdCYYtgcqRjRc3GfpGvNPLOY+baUOQBOYNCD0hRi4P6nBv94
3y8+</wsse:BinarySecurityToken>
      <Signature xmlns="http://www.w3.org/2000/09/xmldsig#">
        <SignedInfo>
          <CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
          <SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#gostr34102001-gostr3411"/>
          <Reference URI="#body">
            <Transforms>
              <Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
            </Transforms>
            <DigestMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#gostr3411"/>
            <DigestValue>JG6DWBXReRTwTyh/t9qrcwiOGQKDE18SiWFu9Q0pj0k=</DigestValue>
          </Reference>
        </SignedInfo>
        <SignatureValue>3F0hisldyYR552PobiZ8x8V0sdqOdkIbg6ZfeS5DTpwMisxPPTMpgMKAOOTPDA3FaJuJQ/ThDj51
ZbEe4LLCOQ==</SignatureValue>
        <KeyInfo>
          <wsse:SecurityTokenReference>
            <wsse:Reference URI="#CertId" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"/>
          </wsse:SecurityTokenReference>
        </KeyInfo>
      </Signature>
    </wsse:Security>
  </S:Header>
  <S:Body wsu:Id="body">
    <ns6:ticketSearchPersonalActRecordBirthRequest xmlns:ns6="http://smev.gosuslugi.ru/rev120315" xmlns:act="http://ezags.rt.ru/type/actor/" xmlns:com="http://ezags.rt.ru/type/common/" xmlns:doc="http://ezags.rt.ru/type/document/" xmlns:ext="http://ezags.rt.ru/type/externaldocuments/" xmlns:ns7="http://ezags.rt.ru/fzags/InterDepPersonalService/type/local/" xmlns:ns8="http://ezags.rt.ru/fzags/StandardReportService/type/local/" xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
      <ns6:Message>
        <ns6:Sender>
          <ns6:Code>FOIV01001</ns6:Code>
          <ns6:Name>ФОИВ</ns6:Name>
        </ns6:Sender>
        <ns6:Recipient>
          <ns6:Code>EZAG01001</ns6:Code>
          <ns6:Name>еЗАГС</ns6:Name>
        </ns6:Recipient>
        <ns6:Originator>
          <ns6:Code>FOIV01001</ns6:Code>
          <ns6:Name>ФОИВ</ns6:Name>
        </ns6:Originator>
        <ns6:ServiceName>EZAGORDER10</ns6:ServiceName>
        <ns6:TypeCode>GSRV</ns6:TypeCode>
        <ns6:Status>RESULT</ns6:Status>
        <ns6:Date>2013-08-08T19:42:35.857+04:00</ns6:Date>
        <ns6:ExchangeType>1</ns6:ExchangeType>
        <ns6:OriginRequestIdRef>0</ns6:OriginRequestIdRef>
      </ns6:Message>
      <ns6:MessageData>
        <ns6:AppData id="AppData">
          <ns7:ticketNumberObj>
            <ns7:return>95114398-65de-4b16-9fc5-e1949fea9405</ns7:return>
          </ns7:ticketNumberObj>
        </ns6:AppData>
      </ns6:MessageData>
    </ns6:ticketSearchPersonalActRecordBirthRequest>
  </S:Body>
</S:Envelope>